Autodesk.Revit.DB.BuiltInFailures.SlantedColumnFailures.SlantedColumnCannotCutEndWarn
Unable to trim slanted column end geometry to desired condition.

Autodesk.Revit.DB.BuiltInFailures.SlantedColumnFailures.SlantedColumnCannotCutEnd
Unable to trim slanted column end geometry to desired condition.

Autodesk.Revit.DB.BuiltInFailures.SlantedColumnFailures.CannotCutParallelToLocationCurve
Cut plane of slanted column end is parallel to the location curve.

Autodesk.Revit.DB.BuiltInFailures.SlantedColumnFailures
Failures about SlantedColumn.